{"basics":{"name":"Robby Aprianto","label":"System Engineer","email":"masrobbya@gmail.com","url":"https://masrobby.github.io","summary":"I'm passionate about infrastructure tech and virtualization. I enjoy optimizing networks and systems, making them more efficient and resilient. Virtualization is a particular interest of mine for its ability to maximize resources and boost performance. Whether it's fine-tuning setups or streamlining operations, I love using tech to innovate and improve.","location":{"address":"Radio Cosmology Research Laboratory, Universiti Malaya","postalCode":"50603","city":"Kuala Lumpur","countryCode":"MY"},"profiles":[{"network":"GitHub","username":"masrobby","url":"https://github.com/masrobby"}]},"work":[{"name":"PT. Mora Telematika Indonesia","position":"Network Operation Center (NOC)","startDate":"2018","endDate":"2018","summary":"As a Network Operation Center (NOC) professional, I am dedicated to ensuring seamless connectivity and operational stability. With a keen eye for detail and extensive experience in network monitoring and troubleshooting, I excel in detecting and resolving issues promptly to minimize downtime and optimize performance. My proactive approach and dedication to maintaining robust networks make me an invaluable asset in the fast-paced world of IT infrastructure management."},{"name":"PT. Indofun Digital Technology","position":"System Administrator","startDate":"2018","endDate":"2020","summary":"As a System Administrator within a publisher game company, I specialize in maintaining the backbone of our gaming infrastructure. My responsibilities encompass ensuring the reliability, security, and scalability of the systems that power our games, from servers to databases and everything in between. With a focus on performance optimization and proactive monitoring, I strive to provide an uninterrupted gaming experience for our players. Leveraging my expertise in network administration, cloud computing, and system automation, I play a vital role in supporting the development and delivery of cutting-edge gaming experiences."},{"name":"PT. Elabram Systems","position":"System Engineer","startDate":"2020","endDate":"Now","summary":"As a System Engineer employed by eLabram and placed within the Huawei office, my role revolves around crafting and implementing robust technological solutions to meet the dynamic needs of Huawei's infrastructure. Tasked with optimizing network architecture, enhancing cybersecurity measures, and ensuring seamless system integration, I thrive in fast-paced environments where innovation and efficiency are paramount. Leveraging my expertise in systems engineering and collaborative prowess, I bridge the gap between eLabram's technical prowess and Huawei's strategic objectives, driving forward-thinking solutions that propel business success and technological advancement."}],"education":[{"institution":"SMK NEGERI 1 CILACAP","url":"https://smkn1cilacap.sch.id","area":"Information Technology","studyType":"Information Technology","startDate":"2013","endDate":"2014","courses":["Grades: 7A+ 1A 1A-"]},{"institution":"Information Technology in STMIK AKAKOM Yogyakarta","url":"https://www.utdi.ac.id/","area":"Information Technology","studyType":"Information Technology","startDate":"2014","endDate":"2017","courses":["Overall GPA: 3.29","STMIK AKAKOM Yogyakarta"]}],"publications":[{"name":"IMPLEMENTASI RASPBERRY PI SEBAGAI PERSONAL EBOOK SERVER DENGAN NGROK TUNNELS DAN UBOOQUITY","publisher":"STMIK AKAKOM Yogyakarta","releaseDate":"2017-08-21","url":"https://eprints.utdi.ac.id/4830/","summary":"Dewasa ini buku digital atau ebook lebih diminati karena ukurannya yang kecil bila dibandingkan dengan buku fisik, dan juga umumnya memiliki fitur pencarian, sehingga kata-kata dalam buku digital dapat dengan cepat dicari dan ditemukan. Selain itu buku digital sangat praktis karena dapat dibuka di smartphone maupun komputer. Transisi penggunaan buku digital dari buku fisik akan membawa dampak pada perpustakaan tradisional . Perpustakaan tradisional mulai ditinggalkan karena kebutuhan mobilitas yang cepat dan fleksibilitas yang tinggi. Seiring semakin ditinggalkannya perpustakaan tradisional, semakin bertambah komputer yang difungsikan sebagai personal server. Personal server sudah semestinya dimiliki setiap rumah/instansi di era modern seperti sekarang ini. Personal server akan menggantikan fungsi perpustakaan tradisional/fisik menjadi digital yang dapat diakses melalui smartphone maupun komputer. Untuk membangun sebuah personal server umumnya dibutuhkan sebuah perangkat komputer desktop. Namun biaya perangkat keras dan pengeluaran listrik untuk penggunaan komputer desktop membutuhkan biaya yang cukup mahal. Penggunaan Raspberry Pi sebagai pengganti komputer desktop bertujuan untuk menghemat biaya pembangunan sistem dan penggunaan listrik yang lebih murah. Raspberry Pi adalah sebuah single board seukuran kartu kredit dengan daya 5V/2A yang bisa beroperasi layaknya komputer biasa, hanya dengan harga $35, karena itu raspberry sangat cocok digunakan untuk membangun sebuah personal ebook server yang murah serta fleksibel. Personal ebook server dibangun menggunakan tools yang bernama ubooquity. Ubooquity merupakan aplikasi yang bersifat gratis yang berfungsi untuk membangun home server untuk buku maupun komik. Ubooquity dapat di akses dari berbagai platform, seperti tablet, handphone, atau komputer yang terhubung dari jaringan lokal. Selain diakses dari jaringan lokal, personal ebook server seharusnya dapat di akses dari jaringan publik untuk mempermudah user dalam mengakses dokumen. Oleh sebab itu digunakan aplikasi yang bernama ngrok. Ngrok adalah sebuah program yang dapat menciptakan sebuah tunneling dari internet publik ke port komputer lokal sehingga server lokal dapat diakses secara publik. Kata Kunci : ebook, ngrok, raspberry pi, server, ubooquity"}],"skills":[{"name":"Networking & Infra Skill","icon":"fa-solid fa-computer","keywords":["Mikrotik","LINUX","GoogleCloud","AlibabaCloud","AWS"]},{"name":"Programming, Scripting, and Typesetting Languages","icon":"fa-solid fa-code","keywords":["Bash","HTML"]}]}